Autodesk.AutoCAD.DatabaseServices.Surface.GetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method AcDbSurface::getSubentMaterialMapper Method.